In [13]:
import numpy as np
import pandas as pd

In [17]:
first_series=pd.Series(list('abcedf'))
print(first_series)

0    a
1    b
2    c
3    d
4    e
5    f
dtype: object

In [18]:
first_series=pd.Series(['a','b','c','d','e','f'])

In [19]:
print(first_series)

0    a
1    b
2    c
3    d
4    e
5    f
dtype: object

In [21]:
country=np.array(['india','australia','japan','united states'])

In [27]:
s_country=pd.Series(country)

In [28]:
print(s_country)

0            india
1        australia
2            japan
3    united states
dtype: object

In [38]:
scalar_series=pd.Series(5.,index=['a','b','c','d','e'])

# vectorised operation in series

In [39]:
first_vector_series=pd.Series([1,2,3,4],index=['a','b','c','d'])

In [41]:
second_vector_series=pd.Series([10,20,30,40],index=['a','b','c','d'])

In [42]:
first_vector_series+second_vector_series

a    11
b    22
c    33
d    44
dtype: int64

In [45]:
second_vector_series=pd.Series([10,20,30,40],index=['a','d','b','c'])

In [46]:
first_vector_series+second_vector_series

a    11
b    32
c    43
d    24
dtype: int64

In [47]:
second_vector_series=pd.Series([10,20,30,40],index=['a','b','e','f'])

In [48]:
first_vector_series+second_vector_series

a    11.0
b    22.0
c     NaN
d     NaN
e     NaN
f     NaN
dtype: float64

# data frame

In [5]:
import pandas as pd

In [6]:
olympic_data_list={'hostcity':['London','Beijing','Athens','Sydney','Atlanta'],'year':[2012,2008,2004,2000,1996],'no.of participating countries':[205,204,201,200,197]}

In [7]:
df_olympic_data=pd.DataFrame(olympic_data_list)

In [10]:
df_olympic_data

  hostcity  year  no.of participating countries
0   London  2012                            205
1  Beijing  2008                            204
2   Athens  2004                            201
3   Sydney  2000                            200
4  Atlanta  1996                            197

# data frame from dict

In [13]:
olympic_data_dict={'London':{2012:205},'Beijing':{2008:204}}

In [14]:
df_olympic_data_dict=pd.DataFrame(olympic_data_dict)

In [15]:
df_olympic_data_dict

      London  Beijing
2012   205.0      NaN
2008     NaN    204.0

# view data frame

In [17]:
df_olympic_data.hostcity

0     London
1    Beijing
2     Athens
3     Sydney
4    Atlanta
Name: hostcity, dtype: object

In [19]:
df_olympic_data.describe

<bound method NDFrame.describe of   hostcity  year  no.of participating countries
0   London  2012                            205
1  Beijing  2008                            204
2   Athens  2004                            201
3   Sydney  2000                            200
4  Atlanta  1996                            197>

# create data frame from dict of series

In [28]:
olympic_series_participation=pd.Series([205,204,201,200,197],index=[2012,2008,2004,2000,1996])
olympic_series_country=pd.Series(['London','Beijing','Athens','Sydney','Atlanta'],index=[2012,2008,2004,2000,1996])

In [29]:
df_olympic_series=pd.DataFrame({'no. of participating countries':olympic_series_participation,'host cities':olympic_series_country})

In [30]:
df_olympic_series

      no. of participating countries host cities
2012                             205      London
2008                             204     Beijing
2004                             201      Athens
2000                             200      Sydney
1996                             197     Atlanta

# data frame from ndarray

In [31]:
import numpy as np

In [36]:
np_array=np.array([2012,2008,2004,2006])
dict_ndarray={'year':np_array}

In [37]:
df_ndarray=pd.DataFrame(dict_ndarray)

In [38]:
df_ndarray

   year
0  2012
1  2008
2  2004
3  2006

# create dataframe from dataframe

In [39]:
df_from_df=pd.DataFrame(df_olympic_series)

In [40]:
df_from_df

      no. of participating countries host cities
2012                             205      London
2008                             204     Beijing
2004                             201      Athens
2000                             200      Sydney
1996                             197     Atlanta

# handle missing values

In [41]:
import pandas as pd

In [56]:
first_series=pd.Series([1,2,3,4,5],index=['a','b','c','d','e'])

In [57]:
second_Series=pd.Series([10,20,30,40,50],index=['c','e','f','g','h'])

In [58]:
sum_of_series=first_series+second_Series

In [59]:
sum_of_series

a     NaN
b     NaN
c    13.0
d     NaN
e    25.0
f     NaN
g     NaN
h     NaN
dtype: float64

In [67]:
sum_of_series.replace(np.NaN,value=0)

a     0.0
b     0.0
c    13.0
d     0.0
e    25.0
f     0.0
g     0.0
h     0.0
dtype: float64

In [68]:
dropna_s=sum_of_series.dropna()

In [69]:
dropna_s

c    13.0
e    25.0
dtype: float64

# data opertion

In [133]:
df_movie_rating=pd.DataFrame({'movie1':[5,4,3,3,2,1],'movie2':[4,5,2,3,4,2]},index=['Ton','Jeff','peter','ram','ted','paul'])

In [134]:
df_movie_rating

       movie1  movie2
Ton         5       4
Jeff        4       5
peter       3       2
ram         3       3
ted         2       4
paul        1       2

In [135]:
df_movie_rating.replace((5,4,3,2,1),list('ABCDE'))

      movie1 movie2
Ton        A      B
Jeff       B      A
peter      C      D
ram        C      C
ted        D      B
paul       E      D

In [136]:
def movie_grade(rating):
    if rating==5:
        return 'A'
    if rating==4:
        return 'B'
    if rating==3:
        return 'C'
    else:
        return 'F'

In [137]:
print(movie_grade(5))

A

In [138]:
df_movie_grade=df_movie_rating.applymap(movie_grade)

In [ ]:
df_movie_grade[df_movie_grade.movie1 !='F']

In [145]:
df=df_movie_grade[df_movie_grade.movie1 !='F']
df[df.movie2 !='F']

     movie1 movie2
Ton       A      B
Jeff      B      A
ram       C      C

# data operation with statistical function

In [2]:
import pandas as pd

In [3]:
df_test_score=pd.DataFrame({'test1':[95,84,73,68,82,65],'test2':[74,85,82,71,77,79]},index=['jack','ledia','patrick','rich','kelly','paula'])

In [4]:
df_test_score.max()

test1    95
test2    85
dtype: int64

In [5]:
df_test_score.mean()

test1    77.833333
test2    78.000000
dtype: float64

In [6]:
df_test_score.std()

test1    11.267949
test2     5.138093
dtype: float64

# data operation using groupby

In [10]:
df_president_name=pd.DataFrame({'first':['george','bill','ronald','jimmy','george'],'last':['bush','clinton','regan','carter','washington']})

In [11]:
df_president_name

    first        last
0  george        bush
1    bill     clinton
2  ronald       regan
3   jimmy      carter
4  george  washington

In [12]:
grouped=df_president_name.groupby('first')

In [14]:
grp_data=grouped.get_group('george')

In [15]:
grp_data

    first        last
0  george        bush
4  george  washington

In [17]:
df_president_name.sort_value('first')

AttributeError: 'DataFrame' object has no attribute 'sort'